In [26]:
import pandas as pd 


file_path = "C:\\Users\Owner\OneDrive\Desktop\Python Projects\Data Analysis With Python Pandas  Data Analysis WarmUp Exercises  Pandas Project\marks.csv"

df = pd.read_csv(file_path)


print(df.head())  

print(df.tail())

      Name  Marks Grades
0  Priyang     98     AA
1   Aadhya     89     AB
2   Krisha     99     AA
3   Vedant     87     AB
4   Parshv     90     AC
      Name  Marks Grades
2   Krisha     99     AA
3   Vedant     87     AB
4   Parshv     90     AC
5   Mittal     83     BA
6  Archana     82     BB

In [40]:
df1.shape
print('Number of Rows', df1.shape[0])
print('Number of Colums', df1.shape[1])

Number of Rows 7
Number of Colums 3

In [42]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Grades  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [44]:
df1.isnull()

    Name  Marks  Grades
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [49]:
df1.isnull().sum()

Name      0
Marks     0
Grades    0
dtype: int64

In [55]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Grades    0
dtype: int64

In [57]:
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [59]:
df1.describe()

           Marks
count   7.000000
mean   89.714286
std     6.676184
min    82.000000
25%    85.000000
50%    89.000000
75%    94.000000
max    99.000000

In [62]:
df1.describe(include='all')

           Name      Marks Grades
count         7   7.000000      7
unique        7        NaN      5
top     Priyang        NaN     AA
freq          1        NaN      2
mean        NaN  89.714286    NaN
std         NaN   6.676184    NaN
min         NaN  82.000000    NaN
25%         NaN  85.000000    NaN
50%         NaN  89.000000    NaN
75%         NaN  94.000000    NaN
max         NaN  99.000000    NaN

In [67]:
df1['Grades'].unique

<bound method Series.unique of 0    AA
1    AB
2    AA
3    AB
4    AC
5    BA
6    BB
Name: Grades, dtype: object>

In [68]:
df1['Grades'].unique()

array(['AA', 'AB', 'AC', 'BA', 'BB'], dtype=object)

In [71]:
df1['Grades'].value_counts()

Grades
AA    2
AB    2
AC    1
BA    1
BB    1
Name: count, dtype: int64

In [82]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

3

In [86]:
sum(df1['Marks'].between(90, 100))

3

In [90]:
df1['Marks'].mean()

np.float64(89.71428571428571)

In [93]:
df1['Marks'].min()

np.int64(82)

In [107]:
def Marks(x):
    return x/2

df1['Half_Marks']=df1['Marks'].apply(Marks)

df1

      Name  Marks Grades  Half_Marks
0  Priyang     98     AA        49.0
1   Aadhya     89     AB        44.5
2   Krisha     99     AA        49.5
3   Vedant     87     AB        43.5
4   Parshv     90     AC        45.0
5   Mittal     83     BA        41.5
6  Archana     82     BB        41.0

In [112]:
df1['Marks'].apply(lambda x:x/2)
df1

      Name  Marks Grades  Half_Marks  Half_Mark
0  Priyang     98     AA        49.0       49.0
1   Aadhya     89     AB        44.5       44.5
2   Krisha     99     AA        49.5       49.5
3   Vedant     87     AB        43.5       43.5
4   Parshv     90     AC        45.0       45.0
5   Mittal     83     BA        41.5       41.5
6  Archana     82     BB        41.0       41.0

In [113]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [118]:
len(df1['Name'])

7

In [121]:
df1

      Name  Marks Grades  Half_Marks  Half_Mark
0  Priyang     98     AA        49.0       49.0
1   Aadhya     89     AB        44.5       44.5
2   Krisha     99     AA        49.5       49.5
3   Vedant     87     AB        43.5       43.5
4   Parshv     90     AC        45.0       45.0
5   Mittal     83     BA        41.5       41.5
6  Archana     82     BB        41.0       41.0

In [145]:
df1['AA_AB']=df1['Grades'].map({'AA':1,'AB':0})

df1

      Name  Marks Grades  Half_Mark  AA_AB
0  Priyang     98     AA       49.0    1.0
1   Aadhya     89     AB       44.5    0.0
2   Krisha     99     AA       49.5    1.0
3   Vedant     87     AB       43.5    0.0
4   Parshv     90     AC       45.0    NaN
5   Mittal     83     BA       41.5    NaN
6  Archana     82     BB       41.0    NaN

In [150]:
df1.drop(['Half_Mark','Grades'],axis=1,inplace=True)
df1

KeyError: "['Half_Mark', 'Grades'] not found in axis"

In [155]:
df1.columns
df1.index

RangeIndex(start=0, stop=7, step=1)

In [158]:
df1.sort_values(by='Marks',ascending=False)

      Name  Marks  AA_AB
2   Krisha     99    1.0
0  Priyang     98    1.0
4   Parshv     90    NaN
1   Aadhya     89    0.0
3   Vedant     87    0.0
5   Mittal     83    NaN
6  Archana     82    NaN

In [172]:
df1[df1['Marks'].isin([99])]

     Name  Marks  AA_AB
2  Krisha     99    1.0